# Join Statements

## Introduction

In this lab, you'll practice your knowledge on Join statements.

## Objectives

You will be able to:
- Write queries that make use of various types of Joins
- Join tables using foreign keys

## CRM Schema

In almost all cases, rather then just working with a single table we will typically need data from multiple tables. 
Doing this requires the use of **joins ** using shared columns from the two tables. 

In this lab, we'll use the same Customer Relationship Management (CRM) database we used in our lecture before!
<img src='Database-Schema.png' width=550>

## Connecting to the Database
Import the necessary packages and connect to the database **data.sqlite**.

In [2]:
#Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite', detect_types=sqlite3.PARSE_COLNAMES)
cur = conn.cursor()

## Display the names of all the employees in Boston.

In [4]:
#Your code here
cur.execute("""SELECT firstName as First, lastName as Last FROM employees
                        JOIN offices
                        using(officeCode)
                        WHERE offices.city = "Boston";
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

   First       Last
0  Julie   Firrelli
1  Steve  Patterson

## Do any offices have no employees?

In [5]:
#Your code here
cur.execute("""SELECT officeCode FROM offices;
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

  officeCode
0          1
1          2
2          3
3          4
4          5

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# -Who is da president of the entire company? 
# -List the buyprice, MSRP and quantity ordered for each productName.
# -What is the most expensive item in this database?
# -List the comments from each customer who lives in Tokyo
# -What percentage of Motorcycles sold are Harley Davidsons?

In [7]:
# Your code here
# -Who is da president of the entire company? 
cur.execute("""SELECT firstName, lastName, jobTitle, reportsTo 
                        FROM employees
                        WHERE reportsTo IS NOT NULL; """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
# df.columns = [i[0] for i in cur.description]
df.head()

         0          1                     2     3
0    Diane     Murphy             President
1     Mary  Patterson              VP Sales  1002
2     Jeff   Firrelli          VP Marketing  1002
3  William  Patterson  Sales Manager (APAC)  1056
4   Gerard     Bondur   Sale Manager (EMEA)  1056

In [8]:
# -List the buyprice, MSRP and quantity ordered for each productName.

cur.execute("""SELECT productName, buyPrice, MSRP, quantityInStock 
                        FROM PRODUCTS;
                        """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                             productName buyPrice    MSRP quantityInStock
0  1969 Harley Davidson Ultimate Chopper    48.81   95.70            7933
1               1952 Alpine Renault 1300    98.58  214.30            7305
2                  1996 Moto Guzzi 1100i    68.99  118.94            6625
3   2003 Harley-Davidson Eagle Drag Bike    91.02  193.66            5582
4                    1972 Alfa Romeo GTA    85.68  136.00            3252

In [11]:
# Your code here
# -List the buyprice, MSRP and quantity ordered for each productName.

cur.execute("""SELECT productName, buyPrice, MSRP, quantityInStock 
                        FROM PRODUCTS
                        ORDER BY buyPrice;
                        """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                                 productName buyPrice    MSRP quantityInStock
0             1998 Chrysler Plymouth Prowler   101.51  163.73            4724
1                     1962 LanciaA Delta 16V   103.42  147.74            6791
2        1958 Chevy Corvette Limited Edition    15.91   35.36            2542
3                    1982 Lamborghini Diablo    16.24   37.76            7723
4  1938 Cadillac V-16 Presidential Limousine    20.61   44.80            2847

In [14]:
# Your code here
#list comments from each customer in tokyo 

cur.execute("""SELECT comments FROM orders
                        JOIN customers
                        USING(customerNumber)
                        WHERE customers.country = 'USA';
                       """)
df = pd.DataFrame(cur.fetchall()) #Take results and create dataframe
df.columns = [i[0] for i in cur.description]
df.head()

                                            comments
0
1
2  Customer very concerned about the exact color ...
3
4

## Level Up: Display the names of each product each employee has sold.

In [24]:
# Your code here
cur.execute("""SELECT firstName, lastName, productName
                    FROM employees
                    JOIN customers 
                    ON employees.employeeNumber = customers.salesRepEmployeeNumber
                    JOIN orders 
                    USING (customerNumber)
                    JOIN orderDetails
                    USING (orderNumber)
                    JOIN products
                    USING (productCode)
                    
                    GROUP BY firstName, lastName, productName;""")
pd.DataFrame(cur.fetchall())

          0          1                                            2
0      Andy     Fixter          18th Century Vintage Horse Carriage
1      Andy     Fixter                       1900s Vintage Bi-Plane
2      Andy     Fixter                      1900s Vintage Tri-Plane
3      Andy     Fixter                           1911 Ford Town Car
4      Andy     Fixter                  1913 Ford Model T Speedster
5      Andy     Fixter                     1917 Grand Touring Sedan
6      Andy     Fixter                     1917 Maxwell Touring Car
7      Andy     Fixter                        1926 Ford Fire Engine
8      Andy     Fixter             1928 British Royal Navy Airplane
9      Andy     Fixter                     1928 Ford Phaeton Deluxe
10     Andy     Fixter                       1928 Mercedes-Benz SSK
11     Andy     Fixter                 1930 Buick Marquette Phaeton
12     Andy     Fixter          1932 Alfa Romeo 8C2300 Spider Sport
13     Andy     Fixter                    1932 Model A Ford J-Coupe
14     Andy     Fixter                           1934 Ford V8 Coupe
15     Andy     Fixter                        1936 Chrysler Airflow
16     Andy     Fixter          1936 Harley Davidson El Knucklehead
17     Andy     Fixter             1936 Mercedes Benz 500k Roadster
18     Andy     Fixter     1936 Mercedes-Benz 500K Special Roadster
19     Andy     Fixter                    1937 Horch 930V Limousine
20     Andy     Fixter                         1937 Lincoln Berline
21     Andy     Fixter    1938 Cadillac V-16 Presidential Limousine
22     Andy     Fixter                      1939 Cadillac Limousine
23     Andy     Fixter                  1939 Chevrolet Deluxe Coupe
24     Andy     Fixter                       1940 Ford Pickup Truck
25     Andy     Fixter                             1940s Ford truck
26     Andy     Fixter      1941 Chevrolet Special Deluxe Cabriolet
27     Andy     Fixter                  1948 Porsche 356-A Roadster
28     Andy     Fixter               1948 Porsche Type 356 Roadster
29     Andy     Fixter                           1949 Jaguar XK 120
...     ...        ...                                          ...
1338  Steve  Patterson            1992 Porsche Cayenne Turbo Silver
1339  Steve  Patterson                              1993 Mazda RX-7
1340  Steve  Patterson                             1995 Honda Civic
1341  Steve  Patterson                        1996 Moto Guzzi 1100i
1342  Steve  Patterson  1996 Peterbilt 379 Stake Bed with Outrigger
1343  Steve  Patterson                             1997 BMW F650 ST
1344  Steve  Patterson                            1997 BMW R 1100 S
1345  Steve  Patterson               1998 Chrysler Plymouth Prowler
1346  Steve  Patterson                 1999 Indy 500 Monte Carlo SS
1347  Steve  Patterson                       1999 Yamaha Speed Boat
1348  Steve  Patterson                            2001 Ferrari Enzo
1349  Steve  Patterson                          2002 Chevy Corvette
1350  Steve  Patterson                             2002 Suzuki XREO
1351  Steve  Patterson                           2002 Yamaha YZR M1
1352  Steve  Patterson         2003 Harley-Davidson Eagle Drag Bike
1353  Steve  Patterson                                ATA: B757-300
1354  Steve  Patterson               America West Airlines B757-200
1355  Steve  Patterson                  American Airlines: B767-300
1356  Steve  Patterson                    American Airlines: MD-11S
1357  Steve  Patterson                             Boeing X-32A JSF
1358  Steve  Patterson                     Collectable Wooden Train
1359  Steve  Patterson             Diamond T620 Semi-Skirted Tanker
1360  Steve  Patterson                                   HMS Bounty
1361  Steve  Patterson                               P-51-D Mustang
1362  Steve  Patterson                                   Pont Yacht
1363  Steve  Patterson                                The Mayflower
1364  Steve  Patterson                               The Queen Mary
1365  Steve  Patterson                        The Schooner Bluenose
1366  Steve  Patterson                                  The Titanic
1367  Steve  Patterson                    The USS Constitution Ship

[1368 rows x 3 columns]

## Level Up: Display the Number of Products each Employee Has sold

In [31]:
#Your code here

cur.execute("""SELECT firstName, lastName, SUM(quantityOrdered) as Total_Sold
                    FROM employees
                    JOIN customers 
                    ON employees.employeeNumber = customers.salesRepEmployeeNumber
                    JOIN orders 
                    USING (customerNumber)
                    JOIN orderDetails
                    USING (orderNumber)
                    JOIN products
                    USING (productCode)
                    
                    GROUP BY firstName;""")
pd.DataFrame(cur.fetchall())

           0          1      2
0       Andy     Fixter   6246
1      Barry      Jones   7486
2   Foon Yue      Tseng   5016
3     George     Vanauf   7423
4     Gerard  Hernandez  14231
5      Julie   Firrelli   4227
6      Larry       Bott   8205
7     Leslie   Thompson  15910
8       Loui     Bondur   6186
9       Mami      Nishi   4923
10    Martin     Gerard   4180
11    Pamela   Castillo   9290
12     Peter      Marsh   6632
13     Steve  Patterson   5561

## Summary

Congrats! You now know how to use Join statements, along with leveraging your foreign keys knowledge!